module("CFG",package.seeall)
FORMULA_FAC_INFO = {}

--======================mainData==========================
FORMULA_FAC_INFO.data = {
	[1] = {id = 1,val = 2},--基础爆伤
	[2] = {id = 2,val = 0.5},--基础格挡
	[3] = {id = 3,val = 0.7},--最大暴击率
	[4] = {id = 4,val = 0.7},--最大闪避率
	[5] = {id = 5,val = 0.7},--最大格挡率
	[6] = {id = 6,val = 0.1},--基础闪避率
	[7] = {id = 7,val = 0.6},--免伤防御因子
	[8] = {id = 8,val = 30000},--暴击R
	[9] = {id = 9,val = 30000},--闪避R
	[10] = {id = 10,val = 30000},--格挡R
	[11] = {id = 11,val = 30000},--增减伤R
	[12] = {id = 12,val = 30000}--无视防御R
}