module("CFG",package.seeall)
FORMULA_FAC_INFO = {}

--======================mainData==========================
FORMULA_FAC_INFO.data = {
	[1] = {id = 1,val = 2},--基础爆伤
	[2] = {id = 2,val = 0.5},--基础格挡
	[3] = {id = 3,val = 0.75},--最大暴击率
	[4] = {id = 4,val = 0.75},--最大闪避率
	[5] = {id = 5,val = 0.75},--最大格挡率
	[6] = {id = 6,val = 0.1},--基础闪避率
	[7] = {id = 7,val = 1},--免伤防御因子
	[8] = {id = 8,val = 1000},--暴击R
	[9] = {id = 9,val = 1000},--闪避R
	[10] = {id = 10,val = 1000},--格挡R
	[11] = {id = 11,val = 30000},--增减伤R
	[12] = {id = 12,val = 30000},--无视防御R
	[13] = {id = 13,val = 30000},--元素触发R
	[14] = {id = 14,val = 0.8},--抗暴减法因子
	[15] = {id = 15,val = 0.8},--命中减法因子
	[16] = {id = 16,val = 0.8},--格挡减法因子
	[17] = {id = 17,val = 1.6},--抗暴R因子
	[18] = {id = 18,val = 1.6},--命中R因子
	[19] = {id = 19,val = 1.6},--冲击R因子
	[20] = {id = 20,val = 0.1},--伤害浮动因子
	[21] = {id = 21,val = 10000}--暴伤R
}